tutorials/laminar/settling/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    walls 
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    inletTop    
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    inletBottom 
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    outletBottom
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    outletTop   
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
