tutorials/laminar/settling/0.orig/thermo:specificHumidity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thermo:specificHumidity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inletTop
    {
        type            zeroGradient;
    }
    inletBottom
    {
        type            zeroGradient;
    }
    outletTop
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    outletBottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
